Бухгалтерские_задачи_Занятие_3/src/DocumentJournals/ДенежныеСредства/ДенежныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DocumentJournal>
  <name>ДенежныеСредства</name>
  <registeredDocuments>Document.ПолучениеДенежныхСредств</registeredDocuments>
  <registeredDocuments>Document.ВыплатыДенежныхСредств</registeredDocuments>
  <columns>
    <name>Наличные</name>
  </columns>
  <columns>
    <name>Сумма</name>
  </columns>
  <columns>
    <name>Валюта</name>
  </columns>
  <columns>
    <name>БухгалтерскийСчет</name>
  </columns>
</mdclass:DocumentJournal>

Бухгалтерские_задачи_Занятие_3/src/ChartsOfAccounts/Счета/Счета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Счета</name>
  <predefined>
    <items>
      <name>Материалы</name>
      <description>Материалы</description>
      <code>10</code>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41</code>
      <childItems>
        <name>ТоварыОпт</name>
        <description>Товары опт</description>
        <code>41.1</code>
      </childItems>
      <childItems>
        <name>ТоварыРозница</name>
        <description>Товары розница</description>
        <code>41.2</code>
      </childItems>
    </items>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>50</code>
    </items>
    <items>
      <name>СчетВБанке</name>
      <description>Счет в банке</description>
      <code>51</code>
    </items>
    <items>
      <name>Поставщики</name>
      <description>Поставщики</description>
      <code>60</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Покупатели</name>
      <description>Покупатели</description>
      <code>62</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>ПокупателямОтгрузили</name>
        <description>Покупателям отгрузили</description>
        <code>62.1</code>
      </childItems>
      <childItems>
        <name>АвансОтПокупателей</name>
        <description>Аванс от покупателей</description>
        <code>62.2</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>ЗарплатаСотрудников</name>
      <description>Зарплата сотрудников</description>
      <code>70</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РасчетыСУчредителями</name>
      <description>Расчеты с учредителями</description>
      <code>75</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>УставныйКапитал</name>
      <description>Уставный капитал</description>
      <code>80</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РасходыДоходы</name>
      <description>Расходы доходы</description>
      <code>90</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ХранениеТоваров</name>
      <description>Хранение товаров</description>
      <code>001</code>
      <offBalance>true</offBalance>
    </items>
  </predefined>
  <attributes>
    <name>НеИспользоватьВПроводках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:ChartOfAccounts>

Бухгалтерские_задачи_Занятие_3/src/DocumentJournals/ДенежныеСредства/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ОбновитьТекущийОстатокНаСервере()

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроводкиОстатки.Счет,
	|	ПроводкиОстатки.СуммаОстатокДт
	|ИЗ
	|	РегистрБухгалтерии.Проводки.Остатки(&Дата, Счет В (&СчетКасса, &СчетБанк), ) КАК ПроводкиОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПроводкиОбороты.Счет,
	|	ЕСТЬNULL(ПроводкиОбороты.СуммаОборотДт, 0) КАК СуммаОборотДт,
	|	ЕСТЬNULL(ПроводкиОбороты.СуммаОборотКт, 0) КАК СуммаОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Проводки.Обороты(&Дата1, &Дата2, , Счет В (&СчетКасса, &СчетБанк), , ) КАК ПроводкиОбороты";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("Дата1", ДобавитьМесяц(НачалоМесяца(ТекущаяДата()),-1));
	Запрос.УстановитьПараметр("Дата2", (НачалоМесяца(ТекущаяДата())-1));
	Запрос.УстановитьПараметр("СчетКасса", ПланыСчетов.Счета.Касса);
	Запрос.УстановитьПараметр("СчетБанк", ПланыСчетов.Счета.СчетВБанке);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеЗаписи = МассивРезультатов.Получить(0).Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Если ВыборкаДетальныеЗаписи.Счет = ПланыСчетов.Счета.Касса Тогда
			КассаОстаток = ВыборкаДетальныеЗаписи.СуммаОстатокДт;
		Иначе	
			БанкОстаток = ВыборкаДетальныеЗаписи.СуммаОстатокДт;
		КонецЕсли;

	КонецЦикла;
	
	ВыборкаДетальныеЗаписи = МассивРезультатов.Получить(1).Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Если ВыборкаДетальныеЗаписи.Счет = ПланыСчетов.Счета.Касса Тогда
			КассаПриход = ВыборкаДетальныеЗаписи.СуммаОборотДт;
			КассаРасход = ВыборкаДетальныеЗаписи.СуммаОборотКт;
		Иначе	
			БанкПриход = ВыборкаДетальныеЗаписи.СуммаОборотДт;
			БанкРасход = ВыборкаДетальныеЗаписи.СуммаОборотКт;
		КонецЕсли;
		
	КонецЦикла;
	

	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекущийОстаток(Команда)
	ОбновитьТекущийОстатокНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьТекущийОстатокНаСервере();
КонецПроцедуры


//--Подключение обработки ожидания---

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ПолучитьТекущийОстаток",60,Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТекущийОстаток() Экспорт 

	ОбновитьТекущийОстатокНаСервере();

КонецПроцедуры // ПолучитьТекущийОстаток()
